FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/ns_ЖурналАвито.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ns_ЖурналАвито</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_ВидыСобытийЖурнала</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Catalogs/ns_ЗапчастиИАксессуары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ns_ЗапчастиИАксессуары</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>AdStatus</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_AdStatus</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AdType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_AdType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AllowEmail</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_AllowEmail</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Availability</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_Availability</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AvitoId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Brand</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_ПроизводителиЗапчастей</v8:Type>
						<v8:Type>cfg:CatalogRef.ns_ПроизводителиШин</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Category</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_Category</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Condition</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_ConditionЗапчасти</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateBegin</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateEnd</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Homologation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Id</Name>
					<Comment>Уникальный идентификатор объявления в вашей базе данных</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ListingFee</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_ListingFee</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LoadIndex</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Model</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>nsDescription</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OEM</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Originality</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_Originality</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OriginalOEM</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OriginalVendor</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ResidualTread</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RimBolts</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_RimBolts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RimBoltsDiameter</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_RimBoltsDiameter</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RimDiameter</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_RimDiameter</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RimOffset</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_RimOffset</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RimType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_RimTypeDisk</v8:Type>
						<v8:Type>cfg:EnumRef.ns_RimTypeWheels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RimWidth</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_RimWidth</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RunFlat</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SpeedIndex</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_SpeedIndex</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TireAspectRatio</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_TireAspectRatio</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TireSectionWidth</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_TireSectionWidthШины</v8:Type>
						<v8:Type>cfg:EnumRef.ns_TireSectionWidthМотошины</v8:Type>
						<v8:Type>cfg:EnumRef.ns_TireSectionWidthКолёса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TireType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_TireType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Title</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TypeId</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_TypeIdЗапчасти</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VideoURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WheelAxle</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_WheelAxle</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выгружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_ШаблоныОбъявлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЗаголовка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_ШаблоныЗаголовков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаПоказаОбъявления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_ЗоныПоказаОбъявления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Quantity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TiresModels</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_TiresModels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/CommonModules/ns_Сопоставление/Ext/Module.bsl
Процедура СопоставитьЭлементНоменклатуры(Ссылка, ИмяМодуля) Экспорт

	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Номенклатура") Тогда
		СсылкаНаНоменклатуру = Ссылка;
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.ХарактеристикиНоменклатуры") Тогда	
		СсылкаНаНоменклатуру = Ссылка.Владелец;
		Если ЗначениеЗаполнено(СсылкаНаНоменклатуру) И НЕ ТипЗнч(СсылкаНаНоменклатуру) = Тип("СправочникСсылка.Номенклатура") Тогда
			Возврат;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если СсылкаНаНоменклатуру.ЭтоГруппа Тогда
		СопоставитьГруппу(СсылкаНаНоменклатуру, СсылкаНаНоменклатуру.Родитель, ИмяМодуля);
	Иначе	
		Если СсылкаНаНоменклатуру.ПометкаУдаления Тогда
			УдалитьЭлемент(СсылкаНаНоменклатуру, ПолучитьТаблицуСопоставления(Ссылка, ИмяМодуля));
		Иначе
			СопоставитьЭлемент(СсылкаНаНоменклатуру, СсылкаНаНоменклатуру.Родитель, ПолучитьТаблицуСопоставления(Ссылка, ИмяМодуля), ИмяМодуля);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

Процедура СопоставитьВсюНоменклатуру() Экспорт
	
	КатегорииСопоставления = ns_Сопоставление.ПолучитьКатегорииСопоставления();
	Для Каждого ИмяМодуля Из КатегорииСопоставления Цикл
		ТаблицаСопоставления = ПолучитьТаблицуСопоставления(, ИмяМодуля);
		
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.Родитель КАК Родитель,
		|	Номенклатура.ЭтоГруппа КАК ЭтоГруппа
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭтоГруппа УБЫВ";
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Возврат;
		КонецЕсли; 
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Попытка
			НачатьТранзакцию();
			
			Пока Выборка.Следующий() Цикл
				Если Выборка.ЭтоГруппа Тогда
					СопоставитьГруппу(Выборка.Ссылка, Выборка.Родитель, ИмяМодуля);
				Иначе	
					СопоставитьЭлемент(Выборка.Ссылка, Выборка.Родитель, ТаблицаСопоставления, ИмяМодуля)
				КонецЕсли; 
			КонецЦикла; 
			
			ЗафиксироватьТранзакцию();		
		Исключение
			Если ТранзакцияАктивна() Тогда
				ОтменитьТранзакцию();
			КонецЕсли; 
			РегистрыСведений.ns_ЖурналАвито.ЗаписатьОшибкуВЖурнал(Перечисления.ns_ВидыСобытийЖурнала.ОшибкаРаботыМодуля, ОписаниеОшибки());
			ns_ОбщегоНазначения.СообщениеПользователю(ОписаниеОшибки());
		КонецПопытки; 
	КонецЦикла; 
	
КонецПроцедуры

Функция СопоставитьГруппу(Ссылка, Родитель, ИмяМодуля)
	
	СсылкаНаГруппу = Справочники[ИмяМодуля].ПолучитьСсылку(Ссылка.УникальныйИдентификатор());
	Если Найти(Строка(СсылкаНаГруппу), "не найден") > 0 Тогда
		ОбъектГруппа = Справочники[ИмяМодуля].СоздатьГруппу();
		ОбъектГруппа.УстановитьСсылкуНового(СсылкаНаГруппу);
	Иначе
		ОбъектГруппа = СсылкаНаГруппу.ПолучитьОбъект();
	КонецЕсли; 
	
	ОбъектГруппа.Номенклатура = Ссылка;
	ОбъектГруппа.Наименование = Ссылка.Наименование;
	Если ЗначениеЗаполнено(Родитель) Тогда
		ОбъектГруппа.Родитель = СопоставитьГруппу(Родитель, Родитель.Родитель, ИмяМодуля);
	КонецЕсли; 
	ОбъектГруппа.Записать();
	
	Возврат ОбъектГруппа.Ссылка;
КонецФункции

Процедура СопоставитьЭлемент(Ссылка, Родитель, ТаблицаСопоставления, ИмяМодуля)
	
	Характеристики = ПолучитьХарактеристики(Ссылка);
	
	//УстановитьБезопасныйРежим(Истина);
	//
	//Для каждого ИмяРазделителя Из ns_ОбщегоНазначенияСервер.РазделителиКонфигурации() Цикл
	//    УстановитьБезопасныйРежимРазделенияДанных(ИмяРазделителя, Истина);
	//КонецЦикла;

	ОбщийМодуль = Вычислить(ИмяМодуля);
	Если Характеристики = Неопределено Тогда
		ОбщийМодуль.Сопоставить(Ссылка, Неопределено, Родитель, ТаблицаСопоставления);
	Иначе
		Для каждого Характеристика Из Характеристики Цикл
			ОбщийМодуль.Сопоставить(Ссылка, Характеристика, Родитель, ТаблицаСопоставления);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура УдалитьЭлемент(Ссылка, ТаблицаСопоставления)
	
	Характеристики = ПолучитьХарактеристики(Ссылка);
	
	Если Характеристики = Неопределено Тогда
		Удалить(Ссылка, Неопределено, ТаблицаСопоставления);
	Иначе
		Для каждого Характеристика Из Характеристики Цикл
			Удалить(Ссылка, Характеристика, ТаблицаСопоставления);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура Удалить(Ссылка, Характеристика, ТаблицаСопоставления)
	СсылкаНаЭлемент = НайтиСопоставление(Ссылка, Характеристика, ТаблицаСопоставления);
	Если СсылкаНаЭлемент = Неопределено Тогда
		Возврат;	
	Иначе
		ОбъектЭлемент = СсылкаНаЭлемент.ПолучитьОбъект();
		ОбъектЭлемент.УстановитьПометкуУдаления(Истина);
		ОбъектЭлемент.Записать();
	КонецЕсли; 
КонецПроцедуры

Функция НайтиСопоставление(Ссылка, Характеристика, ТаблицаСопоставления) Экспорт
	
	Если ЗначениеЗаполнено(Характеристика) Тогда
		Id = Строка(Ссылка.УникальныйИдентификатор()) + "#" + Строка(Характеристика.УникальныйИдентификатор());
	Иначе
		Id = Строка(Ссылка.УникальныйИдентификатор());
	КонецЕсли; 
	
	Возврат ТаблицаСопоставления[Id];
КонецФункции
  
Функция ПолучитьТаблицуСопоставления(Ссылка = Неопределено, ИмяМодуля)
	
	ТаблицаСопоставления = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ns_ЗапчастиИАксессуары.Ссылка КАК Ссылка,
	|	ns_ЗапчастиИАксессуары.Id КАК Id
	|ИЗ
	|	Справочник.ns_ЗапчастиИАксессуары КАК ns_ЗапчастиИАксессуары
	|ГДЕ
	|	ns_ЗапчастиИАксессуары.Id ПОДОБНО &Id
	|	И ns_ЗапчастиИАксессуары.ЭтоГруппа = ЛОЖЬ";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ns_ЗапчастиИАксессуары", ИмяМодуля);
	Если НЕ Ссылка = Неопределено Тогда
		Id = XMLСтрока(Ссылка.УникальныйИдентификатор());
		Запрос.УстановитьПараметр("Id", Id + "%");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ИмяМодуля + ".Id ПОДОБНО &Id", "ИСТИНА");	
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ТаблицаСопоставления;
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ТаблицаСопоставления.Вставить(Выборка.Id, Выборка.Ссылка);	
	КонецЦикла;
	
	Возврат ТаблицаСопоставления;
КонецФункции

Функция ПолучитьКатегорииСопоставления() Экспорт
	КатегорииСопоставления = Новый Массив;
	
	Если ns_ОбщегоНазначенияПовтИсп.ИспользоватьЗапчастиИАксессуары() Тогда
		КатегорииСопоставления.Добавить("ns_ЗапчастиИАксессуары");
	КонецЕсли; 
	Если ns_ОбщегоНазначенияПовтИсп.ИспользоватьБытоваяЭлектроника() Тогда
		КатегорииСопоставления.Добавить("ns_БытоваяЭлектроника");
	КонецЕсли; 
	Если ns_ОбщегоНазначенияПовтИсп.ИспользоватьДляДомаИДачи() Тогда
		КатегорииСопоставления.Добавить("ns_ДляДомаИДачи");
	КонецЕсли; 
	Если ns_ОбщегоНазначенияПовтИсп.ИспользоватьДляБизнеса() Тогда
		КатегорииСопоставления.Добавить("ns_ДляБизнеса");
	КонецЕсли; 
	Если ns_ОбщегоНазначенияПовтИсп.ИспользоватьХоббиИОтдых() Тогда
		КатегорииСопоставления.Добавить("ns_ХоббиИОтдых");
	КонецЕсли; 
	Если ns_ОбщегоНазначенияПовтИсп.ИспользоватьМотоциклыИМототехника() Тогда
		КатегорииСопоставления.Добавить("ns_МотоциклыИМототехника");
	КонецЕсли;
	Если ns_ОбщегоНазначенияПовтИсп.ИспользоватьЛичныеВещи() Тогда
		КатегорииСопоставления.Добавить("ns_ЛичныеВещи");
	КонецЕсли;
	
	Возврат КатегорииСопоставления;
КонецФункции

Функция ПолучитьХарактеристики(Ссылка)
	Характеристики = Неопределено;
	Если ns_ОбщегоНазначенияПовтИсп.ПолучитьСоздаватьОбъявлениеНаКаждуюХарактеристику() Тогда
		Характеристики = ns_Переопределяемый.ПолучитьХарактеристики(Ссылка);
	КонецЕсли;
	
	Возврат Характеристики;
КонецФункции

Процедура ЗаполнитьTitle(ОбъектЭлемент) Экспорт
	
	Заголовок = ns_ШаблонизаторСервер.СформироватьTitle(ns_ОбщегоНазначенияПовтИсп.ПолучитьШаблонЗаголовка(), ОбъектЭлемент.Title, ОбъектЭлемент.Номенклатура, ОбъектЭлемент.Характеристика);
	Если НЕ ЗначениеЗаполнено(ОбъектЭлемент.Title) Тогда
		ОбъектЭлемент.Title = Заголовок;	
		Возврат;
	КонецЕсли;

	Если НЕ ОбъектЭлемент.Title = Заголовок И ns_ОбщегоНазначенияПовтИсп.ПолучитьНеПерезаполнятьЗаголовок() = Ложь Тогда
		ОбъектЭлемент.Title = Заголовок;	
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗаполнитьDescription(Ссылка, ОбъектЭлемент) Экспорт
	
	Описание = ns_Переопределяемый.ПолучитьОписание(Ссылка);
	Если НЕ ЗначениеЗаполнено(ОбъектЭлемент.nsDescription) Тогда
		ОбъектЭлемент.nsDescription = Описание;	
		Возврат;
	КонецЕсли;

	Если НЕ ОбъектЭлемент.nsDescription = Описание И ns_ОбщегоНазначенияПовтИсп.ПолучитьНеПерезаполнятьОписание() = Ложь Тогда
		ОбъектЭлемент.nsDescription = Описание;	
	КонецЕсли; 
	
КонецПроцедуры
